GA_HeatTransfer/GA/CFD/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 2.3039e-5;

boundaryField
{
    inlet 
    {
	type		fixedValue;
	value		$internalField;
    }
    outlet 
    {
	type		zeroGradient;
    }
    "(Surface1|Surface2|Surface3|Surface4)"
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.71;
        value           $internalField;
    }
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
