GA_HeatTransfer/GA/CFD/0/thickness
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    Surface1
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
404
(
0.000563219
0.000560135
0.000563226
0.000563226
0.00056322
0.00056322
0.000563222
0.000563222
...
)
;
    }
    Surface2
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
404
(
0.000563222
0.00056322
0.00056322
0.000563226
0.000563226
0.00056322
0.000563221
0.000563222
...
)
;
    }
    Surface3
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
404
(
0.000563219
0.000560135
0.000563226
0.000563226
0.00056322
0.00056322
0.000563222
0.000563222
...
)
;
    }
    Surface4
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
808
(
0.000563219
0.000563222
0.000563226
0.000560131
0.000560175
0.000563226
0.000563226
0.00056322
...
)
;
    }
}


// ************************************************************************* //
