GA_HeatTransfer/GA/CFD/0/thicknessFraction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thicknessFraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    Surface1
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
404
(
0.999994
0.994518
1.00001
1.00001
0.999995
0.999995
0.999999
0.999999
...
)
;
    }
    Surface2
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
404
(
0.999999
0.999995
0.999995
1.00001
1.00001
0.999996
0.999996
0.999999
...
)
;
    }
    Surface3
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
404
(
0.999994
0.994518
1.00001
1.00001
0.999995
0.999995
0.999999
0.999999
...
)
;
    }
    Surface4
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
808
(
0.999994
1
1.00001
0.99451
0.994589
1.00001
1.00001
0.999995
...
)
;
    }
}


// ************************************************************************* //
